mmokhtar761/freeRTOS_with_EDF_schedular/EDF_Demo KeilARM7_LPC21xx/Keil_FrameWork/FreeRTOSConfig.h
/*
 * FreeRTOS V202112.00
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://www.FreeRTOS.org
 * http://aws.amazon.com/freertos
 *
 * 1 tab == 4 spaces!
 */

#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

#include <lpc21xx.h>
#include "GPIO.h"

/*global functions to use the timer*/
extern void timer1Reset(void);
extern void saveCPU_Time(void);

extern volatile unsigned int hperPeriodTick ;
extern unsigned long cpuIdleTme ;
extern float cpuLoad  ;

/*-----------------------------------------------------------
 * Application specific definitions.
 *
 * These definitions should be adjusted for your particular hardware and
 * application requirements.
 *
 * THESE PARAMETERS ARE DESCRIBED WITHIN THE 'CONFIGURATION' SECTION OF THE
 * FreeRTOS API DOCUMENTATION AVAILABLE ON THE FreeRTOS.org WEB SITE. 
 *
 * See http://www.freertos.org/a00110.html
 *----------------------------------------------------------*/

#define configUSE_PREEMPTION		1
#define configUSE_IDLE_HOOK			0
#define configUSE_TICK_HOOK			1
#define configCPU_CLOCK_HZ			( ( unsigned long ) 60000000 )	/* =12.0MHz xtal multiplied by 5 using the PLL. */
#define configTICK_RATE_HZ			( ( TickType_t ) 1000 )
#define configMAX_PRIORITIES		( 9 )
#define configMAX_Period	     	(  (TickType_t )200 )

#define configMINIMAL_STACK_SIZE	( ( unsigned short ) 90 )
#define configTOTAL_HEAP_SIZE		( ( size_t ) 13 * 1024 )

#define configMAX_TASK_NAME_LEN		( 8 )

#define configUSE_TRACE_FACILITY	0
#define configUSE_16_BIT_TICKS		0
#define configUSE_APPLICATION_TASK_TAG    1
#define configUSE_QUEUE_SETS  1
#define configUSE_EDF_SCHEDULER 1
#define configSUPPORT_DYNAMIC_ALLOCATION 1

#define configIDLE_SHOULD_YIELD		1

#define configQUEUE_REGISTRY_SIZE 0

/* Co-routine definitions. */
#define configUSE_CO_ROUTINES 		0
#define configMAX_CO_ROUTINE_PRIORITIES ( 2 )

/* Set the following definitions to 1 to include the API function, or zero
to exclude the API function. */

#define INCLUDE_vTaskPrioritySet		0
#define INCLUDE_uxTaskPriorityGet		0
#define INCLUDE_vTaskDelete			   	0
#define INCLUDE_vTaskCleanUpResources	0
#define INCLUDE_vTaskSuspend			    1
#define INCLUDE_vTaskDelayUntil		   	1
#define INCLUDE_vTaskDelay			    	1


/*Trace Hooks definitin*/
#define traceTASK_SWITCHED_IN()  \
timer1Reset(); \
if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)1 )  GPIO_write( PORT_0, PIN2, PIN_IS_HIGH);\
else if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)2 )  GPIO_write( PORT_0, PIN3, PIN_IS_HIGH);\
else if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)3 )  GPIO_write( PORT_0, PIN4, PIN_IS_HIGH);\
else if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)4 )  GPIO_write( PORT_0, PIN5, PIN_IS_HIGH);\
else if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)5 )  GPIO_write( PORT_0, PIN6, PIN_IS_HIGH);\
else if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)6 )  GPIO_write( PORT_0, PIN7, PIN_IS_HIGH)

#define traceTASK_SWITCHED_OUT()  \
if      ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)1 )  	GPIO_write( PORT_0, PIN2, PIN_IS_LOW);\
else if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)2 )  GPIO_write( PORT_0, PIN3, PIN_IS_LOW);\
else if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)3 )  GPIO_write( PORT_0, PIN4, PIN_IS_LOW);\
else if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)4 ) 	GPIO_write( PORT_0, PIN5, PIN_IS_LOW);\
else if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)5 ) GPIO_write( PORT_0, PIN6, PIN_IS_LOW);\
else if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)6 ) GPIO_write( PORT_0, PIN7, PIN_IS_LOW);\
/*Idle task*/\
else saveCPU_Time()


	
/*For further tracing*/
/*
#define traceMOVED_TASK_TO_READY_STATE(xTask)\
     if ((xTask->pxTaskTag) == (TaskHookFunction_t)5 )  GPIO_write( PORT_0, PIN4, PIN_IS_HIGH);\
else if ((xTask->pxTaskTag) == (TaskHookFunction_t)6 )  GPIO_write( PORT_0, PIN5, PIN_IS_HIGH)
#define traceTASK_DELAY_UNTIL(x)\
     if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)5 )  GPIO_write( PORT_0, PIN4, PIN_IS_LOW);\
else if ((pxCurrentTCB->pxTaskTag) == (TaskHookFunction_t)6 )  GPIO_write( PORT_0, PIN5, PIN_IS_LOW)
*/
/*
#define traceTASK_INCREMENT_TICK( xTickCount ) \
GPIO_write( PORT_1, PIN0, (pinState_t)(1^GPIO_read(PORT_1 , PIN0 )));\
	 in hyper period tick, stop here to see the counter value\
	if (xTaskGetTickCount ()%hperPeriodTick == 0 )\
	{\
		every one os tick is 1 ms and timer tick is 1/50 ms\
		cpuIdleTme /=50.0;\
		cpuLoad = (float)(cpuIdleTme-hperPeriodTick)/hperPeriodTick;\
		cpuIdleTme	=0;\
  	timer1Reset();\
	}
*/

 

#endif /* FREERTOS_CONFIG_H */
